app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons"
---
  def index
    @lessons = Lesson.all

INSERT INTO "lessons" ("name", "detail", "page_content_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_lesson
      @lesson = Lesson.find(params[:id])