app/controllers/page_contents_controller.rb

SELECT "page_contents".* FROM "page_contents"
---
  def index
    @page_contents = PageContent.all

INSERT INTO "page_contents" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @page_content = PageContent.new(page_content_params)

    respond_to do |format|
      if @page_content.save

SELECT  "page_contents".* FROM "page_contents" WHERE "page_contents"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_page_content
      @page_content = PageContent.find(params[:id])